In [24]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import requests
import csv
from scipy.stats import linregress

In [25]:
#import Econ data from Escambia

Ivan_1 = "./Economic Data/EscambiaCty_Pensacola_housing.csv"

Ivan_housing_df = pd.read_csv(Ivan_1)
Ivan_housing_df.head()

       DATE  Index
0  1/1/1977  41.86
1  1/1/1978  51.38
2  1/1/1979  47.55
3  1/1/1980  51.41
4  1/1/1981  55.65

In [26]:
# remove rows prior to 1990

Ivan_housing_df['DATE'] = pd.to_datetime(Ivan_housing_df['DATE'])

Ivan_housing_df = Ivan_housing_df[Ivan_housing_df["DATE"] >= '2001-01-01']

#Add hurricane, year, location

Ivan_housing_df[['Hurricane','Hurricane Date','Location']] = pd.DataFrame([['Ivan','2004-09-04','Pensacola, FL']], index = Ivan_housing_df.index)

Ivan_housing_df['Hurricane Date'] = pd.to_datetime(Ivan_housing_df['Hurricane Date'])


#We will need to show data from multiple years, so delta from hurricane best option
Ivan_housing_df['Delta'] = ((Ivan_housing_df['DATE'] - Ivan_housing_df['Hurricane Date']).dt.days/365)

Ivan_housing_df['Delta'] = Ivan_housing_df['Delta'].astype(int)

#Rename column 
Ivan_housing_df = Ivan_housing_df.rename(columns={'Index': 'Housing Price Index'})

Ivan_housing_df.head()

,DATE,Housing Price Index,Hurricane,Hurricane Date,Location,Delta
24,2001-01-01,104.53,Ivan,2004-09-04,"Pensacola, FL",-3
25,2002-01-01,108.50,Ivan,2004-09-04,"Pensacola, FL",-2
26,2003-01-01,111.93,Ivan,2004-09-04,"Pensacola, FL",-1
27,2004-01-01,123.11,Ivan,2004-09-04,"Pensacola, FL",0
28,2005-01-01,153.88,Ivan,2004-09-04,"Pensacola, FL",0

In [27]:
#import Econ data from Escambia

Ivan_2 = "./Economic Data/EscambiaCty_Pensacola_PrivateIndustries.csv"

Ivan_HousingAuthorized_df = pd.read_csv(Ivan_2)
Ivan_HousingAuthorized_df.head()

        DATE  Authorizations
0   1/1/1990            5446
1   4/1/1990            5411
2   7/1/1990            5405
3  10/1/1990            5384
4   1/1/1991            5620

In [28]:
# remove rows prior to 1990

Ivan_HousingAuthorized_df['DATE'] = pd.to_datetime(Ivan_HousingAuthorized_df['DATE'])

Ivan_HousingAuthorized_df = Ivan_HousingAuthorized_df[Ivan_HousingAuthorized_df["DATE"] >= '2001-01-01']

#Add hurricane, year, location

Ivan_HousingAuthorized_df[['Hurricane','Hurricane Date','Location']] = pd.DataFrame([['Ivan','2004-09-04','Pensacola, FL']], index = Ivan_HousingAuthorized_df.index)

Ivan_HousingAuthorized_df['Hurricane Date'] = pd.to_datetime(Ivan_HousingAuthorized_df['Hurricane Date'])


#We will need to show data from multiple years, so delta from hurricane best option
Ivan_HousingAuthorized_df['Delta'] = ((Ivan_HousingAuthorized_df['DATE'] - Ivan_HousingAuthorized_df['Hurricane Date']).dt.days/365)

Ivan_HousingAuthorized_df['Delta'] = Ivan_HousingAuthorized_df['Delta'].astype(int)

#Rename column 
Ivan_HousingAuthorized_df = Ivan_HousingAuthorized_df.rename(columns={'Authorizations': 'New Private Housing Structures Authorized'})

Ivan_HousingAuthorized_df.head()

,DATE,New Private Housing Structures Authorized,Hurricane,Hurricane Date,Location,Delta
44,2001-01-01,6555,Ivan,2004-09-04,"Pensacola, FL",-3
45,2001-04-01,6645,Ivan,2004-09-04,"Pensacola, FL",-3
46,2001-07-01,6660,Ivan,2004-09-04,"Pensacola, FL",-3
47,2001-10-01,6665,Ivan,2004-09-04,"Pensacola, FL",-2
48,2002-01-01,6706,Ivan,2004-09-04,"Pensacola, FL",-2

In [29]:
#import Econ data from Escambia

Ivan_3 = "./Economic Data/EscambiaCty_Pensacola_RealGDP.csv"

Ivan_real_GDP_df = pd.read_csv(Ivan_3)
Ivan_real_GDP_df.head()

       DATE   RealGDP
0  1/1/2001  11899359
1  1/1/2002  12011233
2  1/1/2003  12303533
3  1/1/2004  12727406
4  1/1/2005  13075054

In [30]:
# remove rows prior to 1990

Ivan_real_GDP_df['DATE'] = pd.to_datetime(Ivan_real_GDP_df['DATE'])

Ivan_real_GDP_df = Ivan_real_GDP_df[Ivan_real_GDP_df["DATE"] >= '2001-01-01']

#Add hurricane, year, location

Ivan_real_GDP_df[['Hurricane','Hurricane Date','Location']] = pd.DataFrame([['Ivan','2004-09-04','Pensacola, FL']], index = Ivan_real_GDP_df.index)

Ivan_real_GDP_df['Hurricane Date'] = pd.to_datetime(Ivan_real_GDP_df['Hurricane Date'])


#We will need to show data from multiple years, so delta from hurricane best option
Ivan_real_GDP_df['Delta'] = ((Ivan_real_GDP_df['DATE'] - Ivan_real_GDP_df['Hurricane Date']).dt.days/365)

Ivan_real_GDP_df['Delta'] = Ivan_real_GDP_df['Delta'].astype(int)


Ivan_real_GDP_df.head()

        DATE   RealGDP Hurricane Hurricane Date       Location  Delta
0 2001-01-01  11899359      Ivan     2004-09-04  Pensacola, FL     -3
1 2002-01-01  12011233      Ivan     2004-09-04  Pensacola, FL     -2
2 2003-01-01  12303533      Ivan     2004-09-04  Pensacola, FL     -1
3 2004-01-01  12727406      Ivan     2004-09-04  Pensacola, FL      0
4 2005-01-01  13075054      Ivan     2004-09-04  Pensacola, FL      0

In [31]:
#import Econ data from Escambia

Ivan_4 = "./Economic Data/EscambiaCty_Pensacola_unemployment.csv"

Ivan_unemployment_df = pd.read_csv(Ivan_4)
Ivan_unemployment_df.head()

       DATE  Unemployment
0  1/1/1990           6.5
1  2/1/1990           6.0
2  3/1/1990           5.4
3  4/1/1990           5.5
4  5/1/1990           5.4

In [32]:
# remove rows prior to 1990

Ivan_unemployment_df['DATE'] = pd.to_datetime(Ivan_unemployment_df['DATE'])

Ivan_unemployment_df = Ivan_unemployment_df[Ivan_unemployment_df["DATE"] >= '2001-01-01']

#Add hurricane, year, location

Ivan_unemployment_df[['Hurricane','Hurricane Date','Location']] = pd.DataFrame([['Ivan','2004-09-04','Pensacola, FL']], index = Ivan_unemployment_df.index)

Ivan_unemployment_df['Hurricane Date'] = pd.to_datetime(Ivan_unemployment_df['Hurricane Date'])


#We will need to show data from multiple years, so delta from hurricane best option
Ivan_unemployment_df['Delta'] = ((Ivan_unemployment_df['DATE'] - Ivan_unemployment_df['Hurricane Date']).dt.days/365)

Ivan_unemployment_df['Delta'] = Ivan_unemployment_df['Delta'].astype(int)


Ivan_unemployment_df.head()

          DATE  Unemployment Hurricane Hurricane Date       Location  Delta
132 2001-01-01           5.3      Ivan     2004-09-04  Pensacola, FL     -3
133 2001-02-01           4.9      Ivan     2004-09-04  Pensacola, FL     -3
134 2001-03-01           4.7      Ivan     2004-09-04  Pensacola, FL     -3
135 2001-04-01           4.6      Ivan     2004-09-04  Pensacola, FL     -3
136 2001-05-01           4.4      Ivan     2004-09-04  Pensacola, FL     -3

In [33]:
#import Econ data from Escambia

Ivan_5 = "./Economic Data/EscambiaCty_Pensacola_medianincome.csv"

Ivan_median_df = pd.read_csv(Ivan_5)
Ivan_median_df.head()

       DATE Median
0  1/1/1989  23493
1  1/1/1990      .
2  1/1/1991      .
3  1/1/1992      .
4  1/1/1993  27848

In [34]:
# remove rows prior to 1990

Ivan_median_df['DATE'] = pd.to_datetime(Ivan_median_df['DATE'])

Ivan_median_df = Ivan_median_df[Ivan_median_df["DATE"] >= '2001-01-01']

#Add hurricane, year, location

Ivan_median_df[['Hurricane','Hurricane Date','Location']] = pd.DataFrame([['Ivan','2004-09-04','Pensacola, FL']], index = Ivan_median_df.index)

Ivan_median_df['Hurricane Date'] = pd.to_datetime(Ivan_median_df['Hurricane Date'])


#We will need to show data from multiple years, so delta from hurricane best option
Ivan_median_df['Delta'] = ((Ivan_median_df['DATE'] - Ivan_median_df['Hurricane Date']).dt.days/365)

Ivan_median_df['Delta'] = Ivan_median_df['Delta'].astype(int)


Ivan_median_df.head()

         DATE Median Hurricane Hurricane Date       Location  Delta
12 2001-01-01  34160      Ivan     2004-09-04  Pensacola, FL     -3
13 2002-01-01  34528      Ivan     2004-09-04  Pensacola, FL     -2
14 2003-01-01  35347      Ivan     2004-09-04  Pensacola, FL     -1
15 2004-01-01  36743      Ivan     2004-09-04  Pensacola, FL      0
16 2005-01-01  39830      Ivan     2004-09-04  Pensacola, FL      0

In [35]:
#import Econ data from Escambia

Ivan_6 = "./Economic Data/EscambiaCtyPopulation.csv"

Ivan_population_df = pd.read_csv(Ivan_6)
Ivan_population_df.head()

       DATE  Population
0  1/1/1970     205.334
1  1/1/1971     211.100
2  1/1/1972     217.900
3  1/1/1973     219.100
4  1/1/1974     221.600

In [36]:
# remove rows prior to 1990

Ivan_population_df['DATE'] = pd.to_datetime(Ivan_population_df['DATE'])

Ivan_population_df = Ivan_population_df[Ivan_population_df["DATE"] >= '2001-01-01']

#Add hurricane, year, location

Ivan_population_df[['Hurricane','Hurricane Date','Location']] = pd.DataFrame([['Ivan','2004-09-04','Pensacola, FL']], index = Ivan_population_df.index)

Ivan_population_df['Hurricane Date'] = pd.to_datetime(Ivan_population_df['Hurricane Date'])


#We will need to show data from multiple years, so delta from hurricane best option
Ivan_population_df['Delta'] = ((Ivan_population_df['DATE'] - Ivan_population_df['Hurricane Date']).dt.days/365)

Ivan_population_df['Delta'] = Ivan_population_df['Delta'].astype(int)


Ivan_population_df.head()

         DATE  Population Hurricane Hurricane Date       Location  Delta
31 2001-01-01     298.520      Ivan     2004-09-04  Pensacola, FL     -3
32 2002-01-01     298.822      Ivan     2004-09-04  Pensacola, FL     -2
33 2003-01-01     298.309      Ivan     2004-09-04  Pensacola, FL     -1
34 2004-01-01     299.816      Ivan     2004-09-04  Pensacola, FL      0
35 2005-01-01     300.237      Ivan     2004-09-04  Pensacola, FL      0

In [37]:
#export to CSV

output_data_file = './CleanEconData/Ivan_cln_housing.csv'
  
Ivan_housing_df.to_csv(output_data_file, sep=',')

output_data_file2 = './CleanEconData/Ivan_cln_housingauth.csv'
  
Ivan_HousingAuthorized_df.to_csv(output_data_file2, sep=',')

output_data_file3 = './CleanEconData/Ivan_cln_realGDP.csv'
  
Ivan_real_GDP_df.to_csv(output_data_file3, sep=',')

output_data_file4 = './CleanEconData/Ivan_cln_unemployment.csv'
  
Ivan_unemployment_df.to_csv(output_data_file4, sep=',')

output_data_file5 = './CleanEconData/Ivan_cln_median.csv'
  
Ivan_median_df.to_csv(output_data_file5, sep=',')

output_data_file6 = './CleanEconData/Ivan_cln_population.csv'
  
Ivan_population_df.to_csv(output_data_file6, sep=',')